{
    "id": "prod_HOuBfLgCuey35T",
    "name": "August Virtual AppSec Days Summer of Security",
    "currency": "usd",
    "products": [
        {
            "id": "sku_HOuDe84Hc1hBGm",
            "name": "Training: Ethical Hacking for Beginners",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>Ethical Hacking is quite effective for organizations to find out the vulnerabilities of information systems and fix the weaknesses before malicious hackers or adversaries may exploit their systems. This training session is formed to make the students aware of various hacking tools being used in the industry by cybersecurity professionals. <strong><em>Presented by Muhammad Aamir</em></strong></p>",
                "discountable": "True",
                "display_order": "1"
            }
        },
        {
            "id": "sku_HOuEAjaDkkN1FO",
            "name": "Training: Practical OWASP ZAP Scripting",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>During this training you will learn how to work from zero to hero with OWASP ZAP, write your own malicious scripts to run your arbitrary codes and security tests on your target.<br />\nThis training will focus on deep understanding about one of the best penetration test tools “OWASP ZAP” and techniques to write our own scripts in it. <strong><em>Presented by Ali Abdollahi</em></strong></p>",
                "discountable": "True",
                "display_order": "2"
            }
        },
        {
            "id": "sku_HOuEQL4zzGCjEu",
            "name": "Hacking Android & IoT apps by Example",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>All action, no fluff, improve your security analysis workflow and immediately apply these gained skills in your workplace, packed with exercises, extra mile challenges and CTF, self-paced and suitable for all skill levels, with continued education via unlimited email support and lifetime access to training portal with step-by-step video recordings. <strong><em>Presented by Abraham Aranguren</em></strong></p>",
                "discountable": "True",
                "display_order": "3"
            }
        },
        {
            "id": "sku_HOuGUsrIIvMVO2",
            "name": "Training: Ethical Hacking - security seen from an offensive perspective",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>Modules:<br />\n• Penetration testing overview <br />\n• Various types of footprinting tools and countermeasures <br />\n• Network scanning techniques and scanning countermeasures <br />\n• Enumeration techniques and enumeration countermeasures <br />\n• System hacking methodology <br />\n• Packet sniffing techniques, session hijacking<br />\nLevel: beginner-intermediate<br />\n<strong><em>Presented by Gabriel Avramescu</em></strong></p>",
                "discountable": "True",
                "display_order": "4"
            }
        },
        {
            "id": "sku_HOuGOMSbuaiIro",
            "name": "Training: Fuzzing: An effective alternative to code review and penetration testing",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>This course aims to provide a strong base to use fuzzing as an effective alternative to discover vulnerabilities. Attendees will gain usable knowledge on fuzzing, learn to build an effective wordlist, use Python to build application specific fuzzing tools and see use cases to discover OWASP TOP 10 vulnerabilities using fuzzing. <strong><em>Presented by Alper Basaran</em></strong></p>",
                "discountable": "True",
                "display_order": "5"
            }
        },
        {
            "id": "sku_HOuI1vlSNzwCRH",
            "name": "Training: Web the API Security",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>The session would be for Beginners and would cover Common occuring bugs in Web APIs , Some Hands On Training with the online Labs, and some Prevention Techniques for the most common attacks and Some case studies. <strong><em>Presented by Tushar Kulkarni</em></strong></p>",
                "discountable": "True",
                "display_order": "7"
            }
        },
        {
            "id": "sku_HOuJFM5gKuTMGg",
            "name": "Training: Securing the Container Platform",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>Containers are in popular use as the distribution vehicle for cloud-native application services. In this workshop, you'll learn about the fundamental aspects of security that associate with the platform components.  <strong><em>Presented by Mehul Patel</em></strong></p>",
                "discountable": "True",
                "display_order": "8"
            }
        },
        {
            "id": "sku_HOuJZnm9SjNipC",
            "name": "Training: DevSecOps Hands-on: Putting Security Checks into Your Build Pipeline",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>This hands-on workshop integrates security checks into a build pipeline. You will learn and practice what steps can be perfectly automated. Every attendee will get a personal Jenkins server in the cloud ready to use with multiple levels of open-source tool integrations (OWASP ZAP) to create a full-fledged DevSecOps pipeline in guided steps. <strong><em>Presented by Christian Schneider</em></strong></p>",
                "discountable": "True",
                "display_order": "9"
            }
        },
        {
            "id": "sku_HOuKN2MC5W2mfv",
            "name": "Training: Secure By Design: Threat Modeling For Developers",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>Threat Modeling is one of the most effective security activities that you can do for your application, and will help you identify and prioritize potential threats and mitigations. If you're a developer, this workshop will give you the skills and experience you need to build security into your software and create better products!  <strong><em>Presented by Avi Douglen</em></strong></p>",
                "discountable": "True",
                "display_order": "10"
            }
        },
        {
            "id": "sku_HRqG1CJvcsHjU7",
            "name": "Training: Hands-on Threat Modeling and Tooling for DevSecOps",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>Steven teaches you how to use threat modeling and tools to integrate security in DevOps. He teaches a risk-based unified threat modeling practice that is in close alignment with your business objectives. With hands-on practical threat modeling challenges, you will learn the different stages of threat modeling on an incremental CI/CD scenario. <strong><em>Presented by Steven Wierckx</em></strong></p>",
                "discountable": "True",
                "display_order": "11"
            }
        },
        {
            "id": "sku_HlhH1Z6TC8kvd7",
            "name": "FREE TRAINING: Modern Web Application Hacking for Beginners",
            "amount": 0,
            "metadata": {
                "type": "regular",
                "inventory": "228",
                "description": "<p>In this beginner-oriented training you can try out attacks against the modern web applications OWASP Juice Shop! There are almost 100 hacking challenges that are waiting to be solved, but in this training we will focus on up to four categories:<br />\n-Cross-Site Scripting<br />\n-Injection<br />\n-Authentication Flaws<br />\n-Authorization Flaws</p>",
                "discountable": "True",
                "display_order": "21"
            }
        }
    ]
}